domains/UFO/sim/decks/cfd_disc/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet   { type calculated; value uniform 0; }
    outlet  { type calculated; value uniform 0; }
    disc    { type nutkWallFunction; value uniform 0; }
    "(top|bottom|sideY0|sideY1)" { type calculated; value uniform 0; }
}
// ************************************************************************* //
